app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user = current_user
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "wveerv"], ["body", "erverv"], ["user_id", 4], ["created_at", "2020-07-27 15:52:08.532278"], ["updated_at", "2020-07-27 15:52:08.532278"]]