app/controllers/bugs_controller.rb

	def create
    	@project = Project.find(params[:project_id])
    	@bug = @project.bugs.create(bug_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "bugs" ("title", "body", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "svssrv"], ["body", "svrsvr"], ["project_id", 5], ["created_at", "2020-07-30 14:13:28.828586"], ["updated_at", "2020-07-30 14:13:28.828586"]]

  def take_bug_developer
    byebug
    # @user= User.joins(:project).find(params[:id])
    # @user = User.find(params[:user_id])
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]