app/controllers/projects_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", 2]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "projects" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rtgrtgvrt"], ["body", "erverve"], ["user_id", 1], ["created_at", "2020-07-28 16:58:16.018848"], ["updated_at", "2020-07-28 16:58:16.018848"]]
---
  def add_developer

  	@user = User.find(params[:user_id])
  	@users = User.where(user_type: :developer)
  	@project = Project.find(params[:id])
  	@project.users<< @user

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "usersprojects".* FROM "usersprojects" WHERE "usersprojects"."user_id" = ? AND "usersprojects"."project_id" = ? LIMIT ?  [["user_id", 5], ["project_id", 10], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]
DELETE FROM "usersprojects" WHERE "usersprojects"."id" = ?  [["id", 63]]
---
  def  remove_developer

  	@user = User.find(params[:user_id])
  	@users = User.where(user_type: :developer)
  	@project = Project.find(params[:id])
  	userproject = Usersproject.find_by(user_id: @user.id, project_id: @project.id)
    userproject.destroy if userproject

SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", 2]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def assign_project_to_developer

		@users = User.where(user_type: :developer)
		@project = Project.find(params[:id])

INSERT INTO "projects" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "terrthrth"], ["body", "regete"], ["user_id", 7], ["created_at", "2020-08-03 14:12:42.202181"], ["updated_at", "2020-08-03 14:12:42.202181"]]
---
  def create
  	@project = Project.new(project_params)
  	authorize @project
  	@project.user= current_user

  	if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "body" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["body", "rwevwrvgd"], ["updated_at", "2020-07-30 12:34:58.039789"], ["id", 2]]
---
	def update
  	@project = Project.find(params[:id])
  	authorize @project
  	if @project.update(project_params)